#include <Key.h>


//¾ØÕó¼üÅÌ
unsigned char Key_Read()
{
    unsigned char temp = 0;

    // --- É¨ÃèµÚ 1 ÁÐ£ºP3.0 ÖÃµÍ---
    P3 = 0xFE; //1111 1110
    if((P3 & 0x10) == 0) temp = 1;  // ¼ì²â P3.4 (S1)
    if((P3 & 0x20) == 0) temp = 2;  // ¼ì²â P3.5 (S2)
    if((P3 & 0x40) == 0) temp = 3;  // ¼ì²â P3.6 (S3)
    if((P3 & 0x80) == 0) temp = 4;  // ¼ì²â P3.7 (S4)

    // --- É¨ÃèµÚ 2 ÁÐ£ºP3.1 ÖÃµÍ---
    P3 = 0xFD; // 1111 1101
    if((P3 & 0x10) == 0) temp = 5;  // ¼ì²â P3.4 (S5)
    if((P3 & 0x20) == 0) temp = 6;  // ¼ì²â P3.5 (S6)
    if((P3 & 0x40) == 0) temp = 7;  // ¼ì²â P3.6 (S7)
    if((P3 & 0x80) == 0) temp = 8;  // ¼ì²â P3.7 (S8)

    // --- É¨ÃèµÚ 3 ÁÐ£ºP3.2 ÖÃµÍ---
    P3 = 0xFB; //1111 1011
    if((P3 & 0x10) == 0) temp = 9;  // ¼ì²â P3.4 (S9)
    if((P3 & 0x20) == 0) temp = 10; // ¼ì²â P3.5 (S10)
    if((P3 & 0x40) == 0) temp = 11; // ¼ì²â P3.6 (S11)
    if((P3 & 0x80) == 0) temp = 12; // ¼ì²â P3.7 (S12)

    // --- É¨ÃèµÚ 4 ÁÐ£ºP3.3 ÖÃµÍ---
    P3 = 0xF7; //1111 0111
    if((P3 & 0x10) == 0) temp = 13; // ¼ì²â P3.4 (S13)
    if((P3 & 0x20) == 0) temp = 14; // ¼ì²â P3.5 (S14)
    if((P3 & 0x40) == 0) temp = 15; // ¼ì²â P3.6 (S15)
    if((P3 & 0x80) == 0) temp = 16; // ¼ì²â P3.7 (S16)

    return temp;
}

// // ¶ÀÁ¢°´¼ü
// unsigned char Key_Read()
// {
//     unsigned char temp = 0;

//     if((P3 & 0x01) == 0) temp = 1; 
//     if((P3 & 0x02) == 0) temp = 2;
//     if((P3 & 0x04) == 0) temp = 3; 
//     if((P3 & 0x08) == 0) temp = 4;

//     return temp;
// }